# //////////////////////////////////////////////////////////////////////////////////////////////
# // Количество единиц
# // Дана последовательность натуральных чисел  в строке, завершающаяся двумя числами 0 подряд.
# // Определите, сколько раз в этой последовательности встречается число 1. Числа, идущие после двух нулей, необходимо игнорировать.
# //
# // 2176491947586100 -> 3
# //////////////////////////////////////////////////////////////////////////////////////////////
# /*************************************************************************************************

def one_counter(number: int) -> int:
    count = list(str(number).split('00')[0]).count('1')
    return count


print(one_counter(2176491947586100))
print(one_counter(101010101010014134))
