# //////////////////////////////////////////////////////////////////////////////////////////////
# // Палиндром
# // Дано слово, состоящее только из строчных латинских букв. Проверьте, является ли это слово палиндромом. Выведите YES или NO.
# //     При решении этой задачи нельзя пользоваться циклами, в решениях на питоне нельзя использовать срезы с шагом, отличным от 1.
# //////////////////////////////////////////////////////////////////////////////////////////////
# /*************************************************************************************************


def check_for_palindrome(sentence: str) -> bool:
    return list(sentence.lower()) == list(sentence.lower())[::-1]


print(check_for_palindrome('hueuh'))
print(check_for_palindrome('maxixam'))
print(check_for_palindrome('hodor'))
