# //////////////////////////////////////////////////////////////////////////////////////////////
# // Точная степень двойки
# // Дано натуральное число N.
# //     Выведите слово YES, если число N является точной степенью двойки, или слово NO в противном случае.
# //     Операцией возведения в степень пользоваться нельзя!
# //////////////////////////////////////////////////////////////////////////////////////////////


def check_if_pow_of_2(number: int) -> None:
    while number % 2 == 0:
        number = number // 2
        if number == 2:
            print('YES')
            return None
    if number != 2 :
        print("NO")
        return None


check_if_pow_of_2(512)
