#
# //////////////////////////////////////////////////////////////////////////////////////////////
# //  Сумма цифр числа
# // Дано натуральное число N. Вычислите сумму его цифр.
# //     При решении этой задачи нельзя использовать строки,
# //     списки, массивы ну и циклы, разумеется.
# //     Рекурсія)
# //////////////////////////////////////////////////////////////////////////////////////////////
# Довго не міг згадати, як я щось подібне вже вирішував, хех


def sum_of_number(number: int, prev_s: int = 0, dec: int = 1) -> int:
    if number % dec == number:
        print(prev_s)
    elif number % dec != number:
        dec = dec * 10
        prev_s += number % dec // (dec // 10)
        number = number - (number % 10)
        sum_of_number(number, prev_s, dec)


sum_of_number(261)
